# DeleteConstraint

## Description
Removes a constraint from the referenced object in the document.

```pascal
PROCEDURE DeleteConstraint(
				obj        : HANDLE;
				constraint : HANDLE);
```

```python

def vs.DeleteConstraint(obj, constraint):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|Handle to object.|
|constraint|HANDLE|Handle to constraint being deleted.|

## Version
Availability: from VectorWorks9.0
## Category
* Parametric Constraints